<a href="https://colab.research.google.com/github/ravisole/datacleaningProject/blob/master/dataCleaning01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

Data Cleaning

In [3]:
s=pd.Series(['1.0', '2000', 3000])

In [4]:
print(s)

0     1.0
1    2000
2    3000
dtype: object

In [7]:
s1=pd.to_numeric(s)
print(s1)

0       1.0
1    2000.0
2    3000.0
dtype: float64

In [8]:
s2 = (['1.0','#APPLE', 2000])

In [12]:
s2=pd.to_numeric(s2, errors='ignore')

In [10]:
print(s2)

['1.0' '#APPLE' 2000]

In [13]:
s2=pd.to_numeric(s2, errors='coerce')
print(s2) 
# To remove strings in data.

[1.e+00    nan 2.e+03]

In [15]:
df=pd.DataFrame({"training":['AI', 'ML', 'DS', 'DL'],
                 "tools": [np.nan, np.nan, 2, 4],
                 "fee": [30, np.nan, 35, 60]})
print(df)

  training  tools   fee
0       AI    NaN  30.0
1       ML    NaN   NaN
2       DS    2.0  35.0
3       DL    4.0  60.0

In [16]:
df.dropna()
# Drop the rows where atleast one value is missing.

  training  tools   fee
2       DS    2.0  35.0
3       DL    4.0  60.0

In [17]:
df.dropna(axis=1)
# Drop the columns where atleast one value is missing.

  training
0       AI
1       ML
2       DS
3       DL

In [18]:
#Keep the rows with atleast 2 non null values
df.dropna(thresh=2)

  training  tools   fee
0       AI    NaN  30.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [19]:
#Define the columns to look for non null value
df.dropna(subset=['tools'])

  training  tools   fee
2       DS    2.0  35.0
3       DL    4.0  60.0

In [20]:
df.dropna(subset=['fee'])

  training  tools   fee
0       AI    NaN  30.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [21]:
df

  training  tools   fee
0       AI    NaN  30.0
1       ML    NaN   NaN
2       DS    2.0  35.0
3       DL    4.0  60.0

In [22]:
df.fillna(10)

  training  tools   fee
0       AI   10.0  30.0
1       ML   10.0  10.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [23]:
df.fillna(df.mean())

  training  tools        fee
0       AI    3.0  30.000000
1       ML    3.0  41.666667
2       DS    2.0  35.000000
3       DL    4.0  60.000000

In [24]:
df.fillna(method='ffill')

  training  tools   fee
0       AI    NaN  30.0
1       ML    NaN  30.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [25]:
df.fillna(method='bfill')

  training  tools   fee
0       AI    2.0  30.0
1       ML    2.0  35.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [26]:
#Fill with particular values.
values={'tools':3.5, 'fee': 55}
df.fillna(value=values)

  training  tools   fee
0       AI    3.5  30.0
1       ML    3.5  55.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [27]:
df.fillna(value=values, limit=1)

  training  tools   fee
0       AI    3.5  30.0
1       ML    NaN  55.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [28]:
df.replace(4,100)

  training  tools   fee
0       AI    NaN  30.0
1       ML    NaN   NaN
2       DS    2.0  35.0
3       DL  100.0  60.0

In [29]:
df.replace(np.NaN, 0)

  training  tools   fee
0       AI    0.0  30.0
1       ML    0.0   0.0
2       DS    2.0  35.0
3       DL    4.0  60.0

In [30]:
df1 = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})

In [31]:
print(df1)

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [32]:
df1.replace([0,1,2,3,4], 4.5)

     A  B  C
0  4.5  5  a
1  4.5  6  b
2  4.5  7  c
3  4.5  8  d
4  4.5  9  e

In [33]:
df1.replace([1,2,3,4], [21,22,23,24])

    A  B  C
0   0  5  a
1  21  6  b
2  22  7  c
3  23  8  d
4  24  9  e

In [34]:
df1.replace([0,1], method='bfill')

   A  B  C
0  2  5  a
1  2  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [35]:
df1.replace([4,5], method='ffill')

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  3  9  e

In [36]:
#dict like to replace
df1

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [38]:
df1.replace({0:100, 8:800})

     A    B  C
0  100    5  a
1    1    6  b
2    2    7  c
3    3  800  d
4    4    9  e

In [43]:
df1.replace({'A':0, 'B':7}, 300)

     A    B  C
0  300    5  a
1    1    6  b
2    2  300  c
3    3    8  d
4    4    9  e

In [40]:
df1.replace({'A':{0:1000, 4:4598}})

      A  B  C
0  1000  5  a
1     1  6  b
2     2  7  c
3     3  8  d
4  4598  9  e

In [46]:
# Regular Expressio to replace
df2=pd.DataFrame({'A':['2#$@DEad','Ra4$%^',2,4],
                 'B':[1,2,'$%#$3AEdaf', 5],
                  'C':['bat', 'foo', 'bait', 'bar']})

In [47]:
df2

          A           B     C
0  2#$@DEad           1   bat
1    Ra4$%^           2   foo
2         2  $%#$3AEdaf  bait
3         4           5   bar

In [49]:
df2.replace(to_replace='[^0-9]+', value='', regex=True)

   A  B C
0  2  1
1  4  2
2  2  3
3  4  5

In [52]:
df2.replace({'A':'[^0-9]+', 'C':r'^ba.$'}, {'A':'', 'C':'new'}, regex=True)

   A           B     C
0  2           1   new
1  4           2   foo
2  2  $%#$3AEdaf  bait
3  4           5   new

In [56]:
df2.replace(regex='[^0-9]+', value='')

   A  B C
0  2  1
1  4  2
2  2  3
3  4  5

In [58]:
df2.replace(regex={'foo':'xyz', r'^ba.$':'new'})

          A           B     C
0  2#$@DEad           1   new
1    Ra4$%^           2   xyz
2         2  $%#$3AEdaf  bait
3         4           5   new